ams/src/Catalogs/ДатаМобайл_ДополнительныеФормы/ДатаМобайл_ДополнительныеФормы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДатаМобайл_ДополнительныеФормы</name>
  <attributes>
    <name>ИДСправочника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Ограничения</name>
    <attributes>
      <name>Значения</name>
      <type>
        <types>EnumRef</types>
        <types>ChartOfCharacteristicTypesRef</types>
        <types>CatalogRef</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ams/src/Catalogs/ДатаМобайл_ДополнительныеФормы/Forms/ФормаЭлемента/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЭтаФорма.Параметры.Свойство("Владелец") Тогда		
		Объект.Владелец = ЭтаФорма.Параметры.Владелец;
	КонецЕсли; 
	
	ЗаполнитьШтрихкодыЗначений();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ЗаполнитьУникальныйИД();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПроверитьВидимостьОграничений(Объект.ТипДанных);
	ДоступностьКнопкиПечать();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДатаМобайл_ДополнительныеФормы.ИДСправочника
	|ИЗ
	|	Справочник.ДатаМобайл_ДополнительныеФормы КАК ДатаМобайл_ДополнительныеФормы
	|ГДЕ
	|	ДатаМобайл_ДополнительныеФормы.ПометкаУдаления = ЛОЖЬ
	|	И ДатаМобайл_ДополнительныеФормы.Наименование = &Наименование
	|	И ДатаМобайл_ДополнительныеФормы.ТипДанных ПОДОБНО &ТипДанных
	|	И ДатаМобайл_ДополнительныеФормы.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Наименование", Объект.Наименование);
	Запрос.УстановитьПараметр("ТипДанных", Объект.ТипДанных);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДатаМобайл_ОбщийМодуль.СообщитьПользователю("Такая запись уже создана" + Символы.ПС + "Пожалуйста, измените тип или название");
		Отказ = Истина;
	КонецЕсли;
				
	Для каждого СтрокаОграничения Из ТекущийОбъект.Ограничения Цикл
		Если Не ЗначениеЗаполнено(СтрокаОграничения.Значения) Тогда
			ДатаМобайл_ОбщийМодуль.СообщитьПользователю("Не выбрано значение для строки ограничения");
			Отказ = Истина;		
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьШтрихкодыЗначений();
	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ТипДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СЗ = ТипДанныхНачалоВыбораНаСервере();
	ДанныеВыбора = СЗ;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТипДанныхНачалоВыбораНаСервере()
	СЗ = Новый СписокЗначений;
	СЗ.Добавить("Число", "Число");
	СЗ.Добавить("Текст", "Текст");
	СЗ.Добавить("Дата", "Дата");
	СЗ.Добавить("Булево", "Булево");
	СЗ.Добавить("Справочники", "Справочники");
	СЗ.Добавить("Перечисления", "Перечисления");
	СЗ.Добавить("ПланыВидовХарактеристик", "Планы видов характеристик");
	
	Возврат СЗ;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНазванияОбъектов(ТипОбъекта)
	СЗ = Новый СписокЗначений;
	Для каждого стр Из Метаданные[ТипОбъекта] Цикл
		Если Не стр = Метаданные.Справочники.ДатаМобайл_ДополнительныеФормы Тогда
			СЗ.Добавить(стр.Имя, стр.Имя);
		КонецЕсли;
	КонецЦикла;
	Возврат СЗ;
КонецФункции

&НаКлиенте
Функция ВыполнитьПослеЗакрытияВопроса(ВыбранныйЭлемент, ПараметрыОповещения) Экспорт
	
	Если Не ВыбранныйЭлемент = Неопределено Тогда
		Объект.Наименование = ВыбранныйЭлемент.Значение;
		Объект.ТипДанных = ВыбранныйЭлемент.Значение;
		ПроверитьВидимостьОграничений(ВыбранныйЭлемент.Значение);
	Иначе
		ПроверитьВидимостьОграничений("");
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ТипДанныхОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Объект.Ограничения.Очистить();
	
	Если ВыбранноеЗначение = "Справочники" Или ВыбранноеЗначение = "Перечисления" Или ВыбранноеЗначение = "ПланыВидовХарактеристик" Тогда 
		СтандартнаяОбработка = Ложь;
		Оп = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияВопроса", ЭтотОбъект);
		ПоказатьВыборИзСписка(Оп, ПолучитьНазванияОбъектов(ВыбранноеЗначение), Элемент); 
	Иначе
		Объект.Наименование = ВыбранноеЗначение;
		ПроверитьВидимостьОграничений("");
	КонецЕсли;		
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУникальныйИД()
	
	Если Не ЗначениеЗаполнено(Объект.ИДСправочника) Тогда
		Объект.ИДСправочника = Новый УникальныйИдентификатор;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВидимостьОграничений(ТекущийТипДанных)
	
	Если Не ЗначениеЗаполнено(ТекущийТипДанных) 
		Или ТекущийТипДанных = "Текст" 
		Или ТекущийТипДанных = "Число" 
		Или ТекущийТипДанных = "Дата" 
		Или ТекущийТипДанных = "Булево" Тогда
		
		Элементы.Ограничения.Видимость = Ложь;
		
	Иначе
		Элементы.Ограничения.Видимость = Истина;
		
		УстановитьТипДанныхОграничений(ТекущийТипДанных);		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура УстановитьТипДанныхОграничений(ТекущийТипДанных)
	
	Если Не Метаданные.Справочники.Найти(ТекущийТипДанных) = Неопределено Тогда
		ТипЭлемента = "СправочникСсылка." + ТекущийТипДанных;
	ИначеЕсли Не Метаданные.ПланыВидовХарактеристик.Найти(ТекущийТипДанных) = Неопределено Тогда
		ТипЭлемента = "ПланВидовХарактеристикСсылка." + ТекущийТипДанных;	
	ИначеЕсли Не Метаданные.Перечисления.Найти(ТекущийТипДанных) = Неопределено Тогда
		ТипЭлемента = "ПеречислениеСсылка." + ТекущийТипДанных;
	КонецЕсли;
	
	Массив = Новый Массив(); 
	Массив.Добавить(Тип(ТипЭлемента)); 
	ТекущееОграничениеТипов = Новый ОписаниеТипов(Массив);
	
	Элементы.ОграниченияЗначения.ОграничениеТипа = ТекущееОграничениеТипов; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОграниченияЗначенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТипЭлемента = "СправочникСсылка.СкладскиеПомещения";		
	Массив = Новый Массив(); 
	Массив.Добавить(Тип(ТипЭлемента)); 
	ТекущееОграничениеТипов = Новый ОписаниеТипов(Массив);		
	
	Если Элементы.ОграниченияЗначения.ОграничениеТипа = ТекущееОграничениеТипов тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ЗакрытиеВыбораПомещения", ЭтотОбъект),ПолучитьСписокПомещений(), Элементы.Ограничения, 0);	
	КонецЕсли;
	
КонецПроцедуры

&Наклиенте
Процедура ЗакрытиеВыбораПомещения(Результат, ДопПараметры) Экспорт
	
	Попытка Элементы.Ограничения.ТекущиеДанные.Значения = Результат.Значение; Исключение КонецПопытки; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОграниченияЗначенияПриИзменении(Элемент)
	
	ЗаполнитьШтрихкодыЗначений();
	
КонецПроцедуры

&НаКлиенте
Процедура ОграниченияПриИзменении(Элемент)
	
	ДоступностьКнопкиПечать();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокПомещений() 
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СкладскиеПомещения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СкладскиеПомещения КАК СкладскиеПомещения");
	
	СписокВозврата = Новый СписокЗначений;
	СписокВозврата.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	Возврат СписокВозврата;
	
КонецФункции

&НаКлиенте
Процедура ПечатьШК(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = Элементы.Ограничения.ВыделенныеСтроки; 
	МассивЗначенийДопФорм = Новый Массив;
	
	Для каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		ДанныеВыделеннойСтроки = Элементы.Ограничения.ДанныеСтроки(ВыделеннаяСтрока);
		
		СтруктураСтроки = Новый Структура("Форма,Значение,Штрихкод");
		
		СтруктураСтроки.Форма    = СокрЛП(Объект.Наименование);
		СтруктураСтроки.Значение = СокрЛП(ДанныеВыделеннойСтроки.Значения);
		СтруктураСтроки.Штрихкод = ДанныеВыделеннойСтроки.Штрихкод;
		
		МассивЗначенийДопФорм.Добавить(СтруктураСтроки);
	КонецЦикла;
	
	Таб = ПолучитьМакетНаСервере(МассивЗначенийДопФорм);
	
	Если Не Таб = Неопределено Тогда
		Таб.Показать("ШтрихкодыЗначений");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьШтрихкодыЗначений()
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ГУИДДопФорма = XMLСтрока(Объект.Ссылка);
	
	СтруктураПоиска = Новый Структура("Штрихкод", "");
	ПустыеСтроки = Объект.Ограничения.НайтиСтроки(СтруктураПоиска); 
	
	Для каждого ПустаяСтрока Из ПустыеСтроки Цикл
		ГУИДДопФормаЗначение = XMLСтрока(ПустаяСтрока.Значения);
		ПустаяСтрока.Штрихкод = "form_" + ГУИДДопФорма + "_" + ГУИДДопФормаЗначение;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМакетНаСервере(МассивЗначенийДопФорм)
		
	// печать
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ШтрихкодыЗначений");
	
	ТекКолонка = 1;
	ТекСтрока  = 1;
	
	Таб = Новый ТабличныйДокумент;
	Таб.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ШтрихкодыЗначений" + СокрЛП(ИмяКомпьютера());
	
	ЭтикеткаОбласть         = Макет.ПолучитьОбласть(1,1,5,3);
	ОбластьДопФорма         = ЭтикеткаОбласть.Области.ДопФорма;
	ОбластьЗначение         = ЭтикеткаОбласть.Области.ДопФормаЗначение;
	ОбластьШтрихкод         = ЭтикеткаОбласть.Области.ОбластьШтрихкод;
	РисунокШтрихкод         = ЭтикеткаОбласть.Рисунки.Штрихкод;
	
	ВысотаЭтикетки = 55;
	ШиринаЭтикетки = 55;
	
	ОбластьДопФорма.ВысотаСтроки = ВысотаЭтикетки * 2.65 * 0.1;
	ОбластьЗначение.ВысотаСтроки = ВысотаЭтикетки * 2.65 * 0.3;
	ОбластьШтрихкод.ВысотаСтроки = ВысотаЭтикетки * 2.65 * 0.6;
	РисунокШтрихкод.Расположить(ОбластьШтрихкод);
	
	КоличествоСтрок   = 5;
	КоличествоКолонок = 4;
	
	ТекСтрока  = 1;
	ТекКолонка = 1;
	
	ВывелиХотяБыОдинШтрихКод = Ложь;
	
	Модуль_МенеджерОборудованияВызовСервера = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("МенеджерОборудованияВызовСервера");
	Модуль_ГенерацияШтрихкода 				= ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ГенерацияШтрихкода");
	
	Для каждого СтрокаТЧ Из МассивЗначенийДопФорм Цикл				
		КоличествоМиллиметровВПикселе = 0.5;
		
		ПараметрыШтрихкода = Новый Структура;
		ПараметрыШтрихкода.Вставить("Ширина",          Окр(ЭтикеткаОбласть.Рисунки.Штрихкод.Ширина / КоличествоМиллиметровВПикселе));
		ПараметрыШтрихкода.Вставить("Высота",          Окр(ЭтикеткаОбласть.Рисунки.Штрихкод.Высота / КоличествоМиллиметровВПикселе));
		ПараметрыШтрихкода.Вставить("Штрихкод",        СокрЛП(СтрокаТЧ.Штрихкод));
		ПараметрыШтрихкода.Вставить("ТипКода",         16); // QR
		ПараметрыШтрихкода.Вставить("ОтображатьТекст", Ложь);
		ПараметрыШтрихкода.Вставить("РазмерШрифта",    6);
		
		Попытка
			ЭтикеткаОбласть.Рисунки.Штрихкод.Картинка = Модуль_МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
		Исключение
			РезультатОперации = Модуль_ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода);
			Если РезультатОперации.ДвоичныеДанные <> Неопределено Тогда
				ЭтикеткаОбласть.Рисунки.Штрихкод.Картинка = РезультатОперации.Картинка;		
			КонецЕсли;
		КонецПопытки;
	
		ОбластьДопФорма.Текст = "" + СтрокаТЧ.Форма;
		ОбластьЗначение.Текст = "" + СтрокаТЧ.Значение;		
		
		// переход на новую строку
		Если ТекКолонка > КоличествоКолонок Тогда 
			ТекКолонка = 1;
			ТекСтрока = ТекСтрока + 1;
		КонецЕсли;
		
		// переход на новую страницу
		Если ТекСтрока > КоличествоСтрок Тогда
			Таб.ВывестиГоризонтальныйРазделительСтраниц();
			ТекСтрока = 1;
		КонецЕсли;
		
		// вывод этикетки
		Если ТекКолонка = 1 Тогда 			
			Таб.Вывести(ЭтикеткаОбласть);
		Иначе	
			Таб.Присоединить(ЭтикеткаОбласть);
		КонецЕсли;
		
		ТекКолонка = ТекКолонка + 1;
		ВывелиХотяБыОдинШтрихКод = Истина;
	КонецЦикла;
	
	Если ВывелиХотяБыОдинШтрихКод Тогда
		Таб.Защита              = Ложь;
		Таб.ТолькоПросмотр      = Истина;
		Таб.ОтображатьСетку     = Ложь;
		Таб.ОтображатьЗаголовки = Ложь;
		Возврат Таб;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ДоступностьКнопкиПечать()
	
	КнопкаДоступна = (Не Объект.Ограничения.Количество() = 0);
	Элементы.ФормаПечатьШК.Доступность = КнопкаДоступна;
	
КонецПроцедуры

#КонецОбласти
